import pandas as pd


def get_node(p, l):
    """
    简单的从csv的某一列中选取特定的值，重新整合成新的csv
    :param p:  pd对象
    :param l: 选取的节点list
    :return: new csv
    """
    l2 = []
    for i in l:
        n = p.loc[p["ID"] == i]  # 选取的方式
        l2.append(n)
    result = pd.concat(l2, axis=0) # 0为横向整合
    result = pd.DataFrame(result)
    result = result[["X", "Y", "ID"]] # 只要特定的列
    print(result)
    result.to_csv("F:\\AWorkSpace\\QGISData\\node_select.csv", index=False)


def get_list(path):
    """
    将路径下的list节点文件读取，转换成str
    :param path: 文件路径
    :return: str_list
    """
    p = pd.read_csv(path)
    l = list(p["ID"])
    str_list = []
    for i in l:
        str_list.append(str(i))
    print(str_list)
    return str_list


if __name__ == "__main__":
    node_select2 = [3394 ,2322 ,1278, 2580, 2420, 2464 ,1525, 2696 ,3285 ,3241 ,1748 ,1055 ,1807, 2839 ,3498,
 1117 ,3203,  352, 3167,  272, 1903, 2747, 1289, 2269 ,2891, 1395 ,2069, 2633   ,16  ,165,
  652,  635, 1845, 1650, 1092 , 122, 3089, 2626 ,2657 ,1758, 543,  908, 1575 ,3559 ,2328,
  373, 2590 , 910,  711, 1233 ,1749, 2182, 2295, 3158,   43, 2996,  173, 1630, 1842, 1140,
 3475,  656,1848, 1057, 1191,  844 ,1159, 1931, 2271 ,1725 ,1,626 ,2007 ,  13 , 795  ,257,
 3451, 1532, 3421 ,2652 , 120, 1671,  149, 3153 ,1387, 2988 ,1555, 2716, 1182 ,3405, 2560,
 2992,  216, 2005, 2857, 2085, 1963 ,3362, 1899, 2957, 2939]
    node_select = [  154 , 1152 , 1535,  1841 , 2388,  2642 , 3272  ,3883 , 4492 , 4759 , 5904,  6132,
  6341 , 6368,  6558  ,7254 , 7723,  7932 , 8098 , 8937,  9034 ,11287, 11328 ,11782,
 12302 ,13327, 13648, 15415, 15789 ,16880, 17827 ,18064, 18338 ,18691, 20016, 20295,
 20462 ,20474, 21853, 21896 ,26064 ,26571 ,26771 ,26848, 28649, 28778 ,28861, 29549,
 30281, 30284 ,30339 ,32603, 34152, 34660 ,35693 ,36537 ,36568, 37515 ,38147, 38397,
 38522, 38752 ,39835, 41099, 41702 ,42144 ,43894, 44791, 44873 ,45763, 46000 ,46091,
 46277, 48594 ,48994, 49583, 50633 ,51139 ,51565 ,51645, 52374 ,53767, 54322 ,56166,
 56501, 57093 ,57629 ,59420 ,59600, 59704, 60962 ,61383, 61629, 62127 ,63016, 63020,
 63133 ,63402, 64833, 65191]
    node_select_str = []
    for i in node_select:
        node_select_str.append(str(i))
    print(node_select_str)
    p = pd.read_csv("F:\\AWorkSpace\\QGISData\\node.csv")
    p2 = "F:\\AWorkSpace\\QGISData\\simuNodes.csv"
    #l = get_list(p2)
    # get_node(p, l)
    get_node(p, node_select_str)
    """
    l = ["41", "42", "43", "44", "45", "46"]
    get_node(p, l)
    """